src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4023d8d4-9e71-4a9b-b0b9-205c28e22f29">
    <name>ЭкспортСырьевыхТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="540bf057-2915-4a0d-8b55-1833fc259d70">
    <name>ЭкспортНесырьевыхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Enums/СК_СтатусСборкиРеализации/СК_СтатусСборкиРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СК_СтатусСборкиРеализации</name>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>НеСобран</name>
  </enumValues>
</mdclass:Enum>

src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="600ea876-962e-4c78-bacb-7368e2d7bd87">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ee6f4ac0-3f39-4cd9-afb6-ffaa044566fe">
    <name>ВариантКомплектации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee6e203-13d7-45c1-a07a-3d9d0e3231bc">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f77527b-8df0-42ca-9d77-3ba0f3709b21">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36cdefc1-23ca-4fe3-b864-94f83040a429">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a0a01907-71fe-4924-bd74-638b110a692d">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="660a4c7d-a983-455d-8258-5307371c13f8">
    <name>ЗаказНаСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd635e04-353a-4d71-8660-cf3ae445ab1c">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa07f5c4-d5c2-4cb2-9433-e9565f6a27d8">
    <name>СборкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b378b97-d647-4523-9e40-499cc5cb9eee">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42eddef1-f1c0-4c28-868f-c53ff3b76c66">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16013d8-0227-4894-95d4-41b953964e2b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18bd1d8d-c087-4f99-851a-5d41d3f0ed51">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa56f4d-953f-4b01-8a6c-014d0f16ba19">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d54a0d94-be3f-45da-8629-94310dc2c049">
    <name>СтатусУказанияСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4df2676e-97ad-40e1-a0f7-004b51589b67">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad47fd7e-1b44-46ea-a233-e65b10329003">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c19bc0a-7b96-4930-8c74-7f43350faf62">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01b20195-7857-404d-82be-3efae39c7c2c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b2fbcc6-82e8-4e4c-a7c8-fa5896394fca">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ce36f06-f964-4753-83ea-f5b6652e1dec">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b14b82bc-d938-49a1-a8cf-9143fbe41013">
    <name>НоменклатураОсновногоКомпонента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dc6a6404-b09b-4240-846b-07c2552f4996">
    <name>ХарактеристикаОсновногоКомпонента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="75714917-2443-4e00-97e3-3f32e5c1c870">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7b7faa90-f406-40f9-aae7-287a64234bf7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="205a5d62-e0bd-4d13-ac4b-344c70e51e4e">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a25e3b0c-2647-4c12-aa53-991fe77955a6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d08b2132-bc78-45e1-bd1a-275ae1675ac9">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="131bcf48-82b5-4e46-a42a-d7ef41bc417a">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="173cb865-b4b1-4057-9b23-0a67452e9528">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1d46cbbe-be1a-4196-b458-51037d7f1552">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b8557420-3eb9-4319-b879-086b506b92c1">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/СК_МобСклад/Forms/ФормаВП/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если СтруктураПараметров.Ссылка <> "" Тогда
		ДокВП = НайтиСоздатьДокументСборки(СтруктураПараметров.Ссылка);
		Если ДокВП = Ложь Тогда
			Сообщить("Не удалось создать документ сборки");	
		Иначе
			ЗаполнитьТабТовары(ДокВП);
		КонецЕсли;
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция НайтиСоздатьДокументСборки(Док)
	
	ДокСборки = Ложь;
	
	Если ТипЗНЧ(Док) = ТИП("ДокументСсылка.ЗаказНаСборку") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СборкаТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СборкаТоваров КАК СборкаТоваров
		|ГДЕ
		|	СборкаТоваров.ЗаказНаСборку = &ЗаказНаСборку
		|	И СборкаТоваров.ПометкаУдаления = &ПометкаУдаления
		|	И СборкаТоваров.Проведен = &Проведен";
		Запрос.УстановитьПараметр("ЗаказНаСборку",Док);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Проведен",Истина);  
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда  
			ДокСборки = Рез.Ссылка;
		Иначе
			СтруктураП = Новый Структура;
			СтруктураП.Вставить("ЗаполнятьПоОрдеру",Ложь);
			СтруктураП.Вставить("ПоЗаказуНаСборку",Истина);
			СтруктураП.Вставить("ИмяДокумента","СборкаТоваров");
			СтруктураП.Вставить("Дата",ТекущаяДата());
			СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаСборку");
			СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаСборку");
			СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение");

			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(Док.Ссылка);
			СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
			
			Ресурсы = Новый Массив;
			Ресурсы.Добавить("Комплект");
			Ресурсы.Добавить("Комплектующие");
			СтруктураП.Вставить("Ресурсы",Ресурсы);
			
			РеквизитыШапки = Новый Структура; 
			РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным);
			РеквизитыШапки.Вставить("Организация",Док.Ссылка.Организация);
			РеквизитыШапки.Вставить("Подразделение",Док.Ссылка.Подразделение);
			РеквизитыШапки.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
			РеквизитыШапки.Вставить("Склад",Док.Ссылка.Склад);
			РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СборкаТоваров);

			СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
			ДокП = Документы.СборкаТоваров.СоздатьДокумент();
			ДокП.Заполнить(СтруктураП);
			ДокП.Дата = ТекущаяДата();
			ДокП.Ответственный = Док.Автор;
			ДокП.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокСборки = ДокП.Ссылка; 
		КонецЕсли;
		
	ИначеЕсли ТипЗНЧ(Док) = ТИП("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВнутреннееПотребление.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
		|ГДЕ
		|	ВнутреннееПотребление.ЗаказНаВнутреннееПотребление = &ЗаказНаСборку
		|	И ВнутреннееПотребление.ПометкаУдаления = &ПометкаУдаления
		|	И ВнутреннееПотребление.Проведен = &Проведен";
		Запрос.УстановитьПараметр("ЗаказНаСборку",Док);
		Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
		Запрос.УстановитьПараметр("Проведен",Истина);  
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда  
			//ДокСборки = Рез.Ссылка;
			ДСборки = Рез.Ссылка.ПолучитьОбъект();
			ДСборки.Товары.Очистить();
			ТДок = Док.Товары.Выгрузить();
			ДСборки.Товары.Загрузить(ТДок);
			ДСборки.Записать(РежимЗаписиДокумента.Проведение); 
			ДокСборки = ДСборки.Ссылка;
		Иначе
			СтруктураП = Новый Структура;
			СтруктураП.Вставить("ЗаполнятьПоОрдеру",Ложь);
			СтруктураП.Вставить("ПоЗаказуНаСборку",Истина);
			СтруктураП.Вставить("ИмяДокумента","ВнутреннееПотребление");
			СтруктураП.Вставить("Дата",ТекущаяДата());
			СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаВнутреннееПотребление");
			СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаВнутреннееПотребление");
			СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение");
			СтруктураП.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию);

			МассивЗаказов = Новый Массив;
			МассивЗаказов.Добавить(Док.Ссылка);
			СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
			
			
			РеквизитыШапки = Новый Структура; 
			РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным);
			РеквизитыШапки.Вставить("Организация",Док.Ссылка.Организация);
			РеквизитыШапки.Вставить("Подразделение",Док.Ссылка.Подразделение);
			РеквизитыШапки.Вставить("СборкаПодДеятельность",Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
			РеквизитыШапки.Вставить("Склад",Док.Ссылка.Склад);
			РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию);
			РеквизитыШапки.Вставить("Ответственный",Док.Автор);
			
			СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
			ДокП = Документы.ВнутреннееПотребление.СоздатьДокумент();
			ДокП.Заполнить(СтруктураП);
			ДокП.Дата = ТекущаяДата();
			ДокП.Ответственный = Док.Автор;
			ДокП.Записать(РежимЗаписиДокумента.Проведение);
			
			ДокСборки = ДокП.Ссылка; 
		КонецЕсли;
		
	Иначе
		
	КонецЕсли;
	
	Возврат  ДокСборки;

КонецФункции



&НаСервере
Процедура ЗаполнитьТабТовары(Док)
	
	ТабТовары.Очистить();
	
	СКСписание = НайтиДокСписания(Док);
	ВТЧ = Док.Товары.Выгрузить(); 
	
	Если СКСписание.Пустая() = Истина Тогда
		НовыйДок = Документы.СК_СписаниеСклад.СоздатьДокумент();  
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ДокументОснования = Док;
		НовыйДок.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
	Иначе
 		НовыйДок = СКСписание.ПолучитьОбъект();
		Если НовыйДок.Товары.Количество() <> ВТЧ.Количество() Тогда 
			НовыйДок.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйДок.Товары.Очистить();
	НовыйДок.Товары.Загрузить(ВТЧ); 
	
	Попытка
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
		Д = НовыйДок;
		ЭтаФорма.ДокОсн = Д.Ссылка;
	Исключение
		Сообщить("Не удалось создать документ отгрузки");	
	КонецПопытки;
	
	ОбновитьТабТовары();
	
КонецПроцедуры


&НаСервере
Функция НайтиДокСписания(Док)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_СписаниеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	               |ГДЕ
	               |	СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И СК_СписаниеСклад.Проведен = &Проведен
	               |	И СК_СписаниеСклад.ДокументОснования = &ДокументОснования";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ДокументОснования",Док);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Документы.СК_СписаниеСклад.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьТабТовары()
	
	ТабТовары.Очистить();
	
	ВТЧТовары = ЭтаФорма.ДокОсн.Товары.Выгрузить();
	ВТЧСобрано = ЭтаФорма.ДокОсн.СобранныеТовары.Выгрузить();
	ВТЧСобрано.Свернуть("Номенклатура","Количество");
	ТабТовары.Загрузить(ВТЧТовары);
	
	Для Каждого стр из ТабТовары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ВТЧСобрано.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			стр.КоличествоСобрано = Строки[0].Количество; 
		КонецЕсли;
	КонецЦикла; 
	//
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТабТовары.НайтиСтроки(Отбор);
	Если ПСтроки.Количество() = 0 Тогда  
		Док = ДокОсн.ПолучитьОбъект(); 
		//Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран Тогда 
			
			ДокУчет = Док.ДокументОснования.ПолучитьОбъект();
 			
			Если ТипЗНЧ(ДокУчет) = ТИП("ДокументОбъект.СборкаТоваров") Тогда
				Если ДокУчет.Статус = Перечисления.СтатусыСборокТоваров.ВРаботе Тогда
					ДокУчет.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано; 
					ДокУчет.Записать(РежимЗаписиДокумента.Проведение); 
					ДокЗаказа = ДокУчет.ЗаказНаСборку.ПолучитьОбъект();
					ДокЗаказа.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
					ДокЗаказа.Записать(РежимЗаписиДокумента.Проведение); 
					
				КонецЕсли;
			ИначеЕсли ТипЗНЧ(Док) = ТИП("ДокументСсылка.ВнутреннееПотребление") Тогда  
				
			КонецЕсли;
			
			//Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
			//Док.Записать(РежимЗаписиДокумента.Проведение);  
			
		//КонецЕсли;
		
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда 
			ЭтаФорма.Элементы.ГруппаТоваров.Доступность = Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы.Собран.Заголовок = "Документ собран";
	КонецЕсли;
	ТабТовары.Сортировать("Собран ВОЗР");
КонецПроцедуры

&НаКлиенте
Процедура ТабТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормыОстатки = Новый Структура;     
	ПараметрыФормыОстатки.Вставить("Ссылка",ДокОсн);
	ПараметрыФормыОстатки.Вставить("Номенклатура",Элемент.ТекущиеДанные.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаСборкиЗаказа", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры    

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ОбновитьТабТовары();	
КонецПроцедуры
